// 长久（一年以上）待过的地方
var areas = ["烟台市",
			//济南市
			"天桥区", "济南市市中区", "历下区", "历城区", "槐荫区",
			// 杭州市 // TODO “西湖区”在百度GL下变成“东西湖区”，嘿，我知道不对，就是不改，让你改
			"上城区", "滨江区", "杭州市西湖区", "拱墅区", "萧山区", "余杭区",
			// 上海市
			"静安区", "上海市普陀区", "闵行区", "上海市长宁区", "黄浦区", "浦东新区", "杨浦区", "徐汇区", "虹口区", "青浦区"];

// 长久（一年以上）待过的地方 （高德地图用）
var areasAMap = [
			// 烟台市,
			"370600",
			//济南市
			// "天桥区", "市中区", "历下区", "历城区", "槐荫区",
			"370105", "370103", "370102", "370112", "370104",
			// 杭州市
			//"上城区", "滨江区", "西湖区", "拱墅区", "萧山区", "余杭区",
			"330102", "330108", "330106", "330105", "330109", "330110",
			// 上海市
			//"静安区", "普陀区", "闵行区", "长宁区", "黄浦区", "浦东新区", "杨浦区", "徐汇区", "虹口区", "青浦区"
			"310106", "310107", "310112", "310105", "310101", "310115", "310110", "310104", "310109", "310118"];

// 足迹点（百度坐标系）
// 后续添加时间数据，可能不太准确，基本为第一次到达时间
var points = [
	// 东京(遗憾啊,没好好逛过，基本按照时间顺序）
	{"flag":"0", "date":"20170325", "lng":140.392831, "lat":35.772015, "title":"", "content":""}, // 成田机场 第一次到日本的地方，日本的环境是真的好
	{"flag":"0", "date":"20170325", "lng":139.77115411219123, "lat":35.72756533558696, "title":"", "content":""}, // 日暮里 中转站，スカイライナー很快
	{"flag":"0", "date":"20170325", "lng":139.70050238383146, "lat":35.68978747120823, "title":"", "content":""}, // 新宿 大车站，真的很大。可惜新宿只在车站里转悠
	{"flag":"0", "date":"20170325", "lng":139.450899, "lat":35.623931, "title":"多摩市", "content":"第一次在日本住的地方，3个多月。赶上樱花盛开。紫阳花也很漂亮。被大神拉去锻炼，跑过10公里。因为当时的原因，留下满满的遗憾……", "img":"img/map/duomo.jpg"}, // 尝试了很多吃的，比如哈根达斯在日本是真的便宜，柿种，竹轮。天气好的时候能看到富士山，不过没有留下照片。
	{"flag":"0", "date":"20170326", "lng":139.45034789, "lat":35.63361358, "title":" ", "content":"", "img":"img/map/duomoss.jpg"}, // 諏訪神社 到达第二天去遛弯，只是在门口看了一下
	{"flag":"0", "date":"20170327", "lng":139.4462998906179, "lat":35.63700672609453, "title":"", "content":""}, // 市政厅，在留卡入驻
	{"flag":"0", "date":"20170327", "lng":139.44822890332227, "lat":35.643382665109506, "title":" ", "content":"", "img":"img/map/duomoroad1.jpg"}, // 办卡途中
	{"flag":"0", "date":"20170327", "lng":139.4479863608346, "lat":35.64754037966764, "title":" ", "content":"", "img":"img/map/duomoroad2.jpg"}, // 办卡途中
	{"flag":"0", "date":"20170327", "lng":139.446201, "lat":35.650488, "title":"", "content":""}, // 三菱UFJ銀行聖蹟桜ヶ丘支店（第一次办银行卡的地方，结果失败）
	{"flag":"0", "date":"20170328", "lng":139.769631, "lat":35.692301, "title":"", "content":""}, // 神田（"工作"的地方）
	{"flag":"0", "date":"2017", "lng":139.7741140288466, "lat":35.69139610955185, "title":"", "content":""}, // 面试
	{"flag":"0", "date":"20170408", "lng":139.434016, "lat":35.630271, "title":"乞田川", "content":"偶然路过，樱花很漂亮", "img":"img/map/kottagawa.jpg"},
	{"flag":"0", "date":"20170408", "lng":139.421731, "lat":35.621865, "title":"", "content":""}, // 多摩邮局（代购邮寄）和朋友逛过附近商场，办过银行卡
	{"flag":"0", "date":"20170409", "lng":139.460718, "lat":35.637997, "title":"樱丘公园", "content":"落樱缤纷，很多花草，紫阳花（动漫中的夏天）。去过几次，走遍了。夕日丘可以眺望城市，日景夜景都看过。在那里读过轻小说，被蚊子咬了几个包。",
	"img":"img/map/yingqiupark.jpg"},
	{"flag":"0", "date":"20170415", "lng":139.46988041025483,"lat":35.61465438857804, "title":" ", "content":"", "img":"img/map/duomoroad3.jpg"}, // 采购途径 西光寺
	{"flag":"0", "date":"20170415", "lng":139.4713895635116, "lat":35.61606282694555, "title":"", "content":""}, // 業務スーパー黒川店 和朋友大采购的地方，比如水饺
	{"flag":"0", "date":"20170422", "lng":139.77485513089232,"lat":35.68687791461905,"title":"","content":""}, // TOHOシネマズ日本橋 和以前的同事看柯南剧场版，并在附近搓了一顿
		// 秋叶原
	{"flag":"0", "date":"20170429", "lng":139.77141012926157, "lat":35.699629333565994, "title":"秋叶原:步行者天国", "content":"宅的天堂，宅的三大圣地之一。曾是最想去的地方，没有之一。只可惜去了两次（走之前&quot;下班&quot;溜了一圈）"},
	{"flag":"0", "date":"20170429", "lng":139.77196707867776, "lat":35.69795491110653, "title":"秋葉原ラジオ会館", "content":"", "img":"img/map/rajio.jpg"},
	{"flag":"0", "date":"20170429", "lng":139.76829300914196, "lat":35.701417299125865, "title":"明神男坡", "content":"", "img":"img/map/nansaka.jpg"},
	{"flag":"0", "date":"20170429", "lng":139.76761478848192, "lat":35.70206579303068, "title":"神田神社", "content":"", "img":"img/map/kandajinjya.jpg"},
	{"flag":"0", "date":"20170429", "lng":139.77101936636473, "lat":35.7012817375806, "title":"牛丼専門サンボ", "content":"命运石之门有出现，顺便吃了午饭", "img":"img/map/gyuudonn.jpg"},
	{"flag":"0", "date":"20170429", "lng":139.77135173940343, "lat":35.70186794799673, "title":"秋葉原ガチャポン会館", "content":"第一次扭蛋，还中了个徽章", "img":"img/map/gatyapon.jpg"},
	{"flag":"0", "date":"20170429", "lng":139.77335945221822, "lat":35.69787796742763, "title":"", "content":""}, // ブックオフ秋葉原駅前店 买了第一本轻小说
	{"flag":"0", "date":"20170429", "lng":139.77179640063085,"lat":35.69817474977633, "title":" ", "content":"", "img":"img/map/qyy.jpg"},
	{"flag":"0", "date":"2017", "lng":139.443138, "lat":35.61391, "title":"", "content":""}, // bookoff多摩永山店
	{"flag":"0", "date":"20170429", "lng":139.77233987546438, "lat":35.700611254086, "title":"UDX大厦", "content":"东京动漫中心", "img":"img/map/udx.jpg"},
	{"flag":"0", "date":"20170513", "lng":139.773935, "lat":35.715432, "title":"上野公园", "content":"和朋友一起去，第一次(请)喝星巴克", "img":"img/map/sygy.jpg"},
	{"flag":"0", "date":"20170513", "lng":139.77236233310214,"lat":35.713796385249424, "title":" ", "content":"", "img":"img/map/hyss.jpg"},
	{"flag":"0", "date":"20170513", "lng":139.774518, "lat":35.710061, "title":"阿美横商店街", "content":""}, // 主要去地下食品街采购中国食材
	{"flag":"0", "date":"20170520", "lng":139.4598257642779,"lat":35.62615899523437, "title":" ", "content":"", "img":"img/map/duomoturugibasi.jpg"}, // 和朋友路过看到的 剑桥
	{"flag":"0", "date":"20170529", "lng":139.469234, "lat":35.626468, "title":"", "content":""}, // 卢屋书店稻城若叶台店（骨王在这买的）
	{"flag":"0", "date":"20170617", "lng":139.46089172,"lat":35.64185714, "title":" ", "content":"", "img":"img/map/yingqiuparkxiriqiu.jpg"},
	{"flag":"0", "date":"20170617", "lng":139.450212, "lat":35.653337, "title":"多摩川", "content":"", "img":"img/map/duomochuan.jpg"},
	{"flag":"0", "date":"20170511", "lng":139.53331425384192, "lat":35.63374320118872, "title":"", "content":""}, // 京王稻田堤→稻田堤
	{"flag":"0", "date":"20170511", "lng":139.61032149368478, "lat":35.5997212024177, "title":"", "content":""}, // 武藏沟口→沟口
	{"flag":"0", "date":"20170511", "lng":139.627906, "lat":35.6119, "title":"", "content":""}, // 二子玉川（附近面试） 第一次在日本做出租车
	{"flag":"0", "date":"20170525", "lng":139.76155122628955, "lat":35.703395738457864, "title":"", "content":""}, // 御茶水附近 富士ビル（面试）
	{"flag":"0", "date":"20170609", "lng":139.7638239392298, "lat":35.67559779026176, "title":"", "content":""}, // 有乐町，路痴加日语渣换乘太难了
	{"flag":"0", "date":"20170609", "lng":139.796006, "lat":35.655449, "title":"", "content":""}, // 丰州（附近面试）
	{"flag":"0", "date":"20170609", "lng":139.73295816190696, "lat":35.70973007488197, "title":"", "content":""}, // 江户川桥（附近面试）
	{"flag":"0", "date":"20170630", "lng":139.74763198241246, "lat":35.645652583629996, "title":"", "content":""}, // 田町（附近面试）
	{"flag":"0", "date":"2017", "lng":139.76894, "lat":35.681535, "title":"", "content":""}, // 大丸百货（代购侦查去过一次）
	// 名古屋
	{"flag":"0", "date":"20170909", "lng":136.814647, "lat":34.859167, "title":"", "content":""}, // 中部国际机场
	{"flag":"0", "date":"20170909", "lng":136.92128000978553, "lat":35.17071572389569, "title":" ", "content":"", "img":"img/map/sinsakae.jpg"},
	{"flag":"0", "date":"20170909", "lng":136.920355, "lat":35.172214, "title":"新荣町", "content":"在名古屋待了半年，整体还行，就是过得比较艰苦（自己带的日元，没敢太嗨）", "img":"img/map/sinsakaezc.jpg"},
	{"flag":"0", "date":"20170910", "lng":136.9099549632249, "lat":35.170290722192185, "title":"荣", "content":"附近经常去，bookoff蹭书看（买过几本），地下街，以及代购，偶尔和别人出去吃", "img":"img/map/sakaeadd.jpg"}, // img20180217 走之前拍的
	{"flag":"0", "date":"20170911", "lng":136.911372, "lat":35.173703, "title":"", "content":""}, // 中部电力（工作）
	{"flag":"0", "date":"20170917", "lng":136.90477131, "lat":35.18227203, "title":" ", "content":"", "img":"img/map/mgwsys.jpg"},
	{"flag":"0", "date":"20170917", "lng":136.90313411048461, "lat":35.18403291261324, "title":" ", "content":"", "img":"img/map/mgwcdm.jpg"}, // 名古屋城-东门
	{"flag":"0", "date":"20170917", "lng":136.89758258243296, "lat":35.18357564134809, "title":" ", "content":"", "img":"img/map/mgwczm.jpg"}, // 名古屋城-正门
	{"flag":"0", "date":"20170917", "lng":136.89581203, "lat":35.18422989, "title":" ", "content":"", "img":"img/map/mgwcww.jpg"},
	{"flag":"0", "date":"20170917", "lng":136.89601414873962, "lat":35.18658988090235, "title":" ", "content":"", "img":"img/map/mgwc.jpg"},
	{"flag":"0", "date":"20170917", "lng":136.8973795731148, "lat":35.18736426140786, "title":" ", "content":"", "img":"img/map/mgwcww2.jpg"},
	{"flag":"0", "date":"20170917", "lng":136.89917618413475, "lat":35.18747857408984, "title":"名古屋城", "content":"附近转过，第一次去因为台风不能进（其实没钱，后来也没进去）", "img":"img/map/mgwcww3.jpg"},
	{"flag":"0", "date":"20170917", "lng":136.90149183072555, "lat":35.18689500529755, "title":" ", "content":"", "img":"img/map/mcgy.jpg"}, // 名城公园
	{"flag":"0", "date":"20170917", "lng":136.90421358514993, "lat":35.18611548994793, "title":" ", "content":"", "img":"img/map/mgwcww4.jpg"},
	{"flag":"0", "date":"20170917", "lng":136.9065940947514, "lat":35.16973365754099, "title":" ", "content":"", "img":"img/map/sakae.jpg"}, // SUNSHINE SAKAE
	{"flag":"0", "date":"20170917", "lng":136.9085711871957, "lat":35.16982278910119, "title":" ", "content":"", "img":"img/map/nagoyatvtfirst.jpg"},
	{"flag":"0", "date":"201709", "lng":136.908295, "lat":35.172342, "title":"名古屋电视塔", "content":""},
	{"flag":"0", "date":"20170924", "lng":136.92156746754873, "lat":35.174164183182896, "title":" ", "content":"", "img":"img/map/mgwroad.jpg"}, // 路上看见银杏
	{"flag":"0", "date":"20170924", "lng":136.91205195792136,　"lat":35.12631355306516, "title":" ", "content":"", "img":"img/map/sgq.jpg"},
	{"flag":"0", "date":"20171015", "lng":136.90931014014174, "lat":35.126221351690845, "title":"热田神宫", "content":"步行18.45公里耗时3:31:08，下雨，打伞的手好累(裤子一半鞋子全湿透)，第一次见巫女。后来去买御守，也是步行来回的（穷）", "img":"img/map/atudajingun.jpg"}, // 热田神宫-神乐殿
	{"flag":"0", "date":"20171015", "lng":136.90843224557548, "lat":35.12657955252291, "title":" ", "content":"", "img":"img/map/rtsgbg.jpg"}, // 热田神宫-本宫
	{"flag":"0", "date":"20171015", "lng":136.90942455051805, "lat":35.12778416114145, "title":" ", "content":"", "img":"img/map/rtsgxxj.jpg"}, // 热田神宫-こころの小径 位置不准确
	{"flag":"0", "date":"20171015", "lng":136.90817781, "lat":35.12627997, "title":" ", "content":"", "img":"img/map/rtsgqdd.jpg"}, // 热田神宫-祈祷殿
	{"flag":"0", "date":"20171015", "lng":136.90832011, "lat":35.12298975, "title":" ", "content":"", "img":"img/map/rtsg.jpg"},
	{"flag":"0", "date":"20171015", "lng":136.90825014, "lat":35.12308778, "title":" ", "content":"", "img":"img/map/rtsgszwmss.jpg"}, // 热田神宫-上知我麻神社
	{"flag":"0", "date":"20171015", "lng":136.91244508, "lat":35.12670347, "title":" ", "content":"", "img":"img/map/rtsgfh.jpg"},
	{"flag":"0", "date":"20171015", "lng":136.91405644, "lat":35.12988019, "title":" ", "content":"", "img":"img/map/sgpsgc.jpg"}, // 神宫东公园 南园-喷水广场
	{"flag":"0", "date":"20171015", "lng":136.91415053, "lat":35.13084775, "title":" ", "content":"", "img":"img/map/sgbqgc.jpg"}, // 神宫东公园 北园-壁泉广场
	{"flag":"0", "date":"20171105", "lng":136.89221520701082, "lat":35.17392808761858, "title":"四间道", "content":"自己去过，发现有庆典，后来和别人一起转过", "img":"img/map/sjd.jpg"},
	{"flag":"0", "date":"20171105", "lng":136.89085181429886, "lat":35.17629744446045, "title":" ", "content":"", "img":"img/map/edssdj.jpg"}, // 円頓寺商店街
	{"flag":"0", "date":"20171105", "lng":136.90805017, "lat":35.17485356, "title":" ", "content":"", "img":"img/map/nagoyatvt.jpg"},
	{"flag":"0", "date":"20171119", "lng":136.89940397946634, "lat":35.15945796718894, "title":"大须观音寺", "content":"大须，宅的三大圣地之一，逛过一些店铺，可惜没有拍赤门", "img":"img/map/daxu.jpg"},
	{"flag":"0", "date":"20171119", "lng":136.90417847325187, "lat":35.158318124290254, "title":"大须商店街", "content":"", "img":"img/map/daxusyotengai.jpg"},
	{"flag":"0", "date":"2017", "lng":136.8833534231549, "lat":35.17004071153502, "title":"", "content":""}, // ビックカメラ名古屋　ＪＲゲートタワー店 附近去过几次，陪朋友买过耳机。名古屋站附近，一来名古屋就中转了
	{"flag":"0", "date":"2017", "lng":136.936789, "lat":35.192492, "title":"", "content":""}, // QBハウス（理发）
	{"flag":"0", "date":"2017", "lng":136.932437, "lat":35.184333, "title":"德川园", "content":"没进去，只是围着饶了一圈"}, // 理发途径
	{"flag":"0", "date":"2017", "lng":136.926409, "lat":35.171324, "title":"", "content":""}, // バロー車道店（经常去的超市）
	{"flag":"0", "date":"2017", "lng":136.922228, "lat":35.177992, "title":"", "content":""}, // マックスバリュ　代官店（活动范围扩大 超市）
	{"flag":"0", "date":"2017", "lng":136.920489, "lat":35.163722, "title":"", "content":""}, // バロー 新栄店（活动范围扩大 超市）
	{"flag":"0", "date":"2017", "lng":136.918935, "lat":35.155504, "title":"", "content":""}, // 鹤舞公园，去田神宫路过
	{"flag":"0", "date":"20171202", "lng":137.1558723657169, "lat":35.087070282131116, "title":"", "content":""}, // 豊田 本来打算从这里去香岚溪的额，发现bus都错过了，然后去的猿投做的bus
	{"flag":"0", "date":"20171202", "lng":137.1785500883163, "lat":35.1219604328598, "title":"", "content":""}, // 猿投 第一次体验日本的bus
	{"flag":"0", "date":"20171202", "lng":137.31257277887747, "lat":35.13404591864856, "title":"　", "content":"", "img":"img/map/xlx.jpg"},
	{"flag":"0", "date":"20171202", "lng":137.31314769440385, "lat":35.13320460603569, "title":"　", "content":"", "img":"img/map/xlx2.jpg"},
	{"flag":"0", "date":"20171202", "lng":137.3132420164824, "lat":35.131879889887465, "title":"　", "content":"", "img":"img/map/xlx3.jpg"},
	{"flag":"0", "date":"20171202", "lng":137.31423913559848, "lat":35.12975070444014, "title":"　", "content":"", "img":"img/map/xlx4.jpg"},
	{"flag":"0", "date":"20171202", "lng":137.3124784567989, "lat":35.13374334231543, "title":"香岚溪", "content":"赏枫叶的地方，可惜去的有点晚，枫叶的状态不是很好。", "img":"img/map/kourannkei.jpg"},
	{"flag":"0", "date":"20171202", "lng":137.3112163375574, "lat":35.13389832057902, "title":"　", "content":"", "img":"img/map/xlx5.jpg"}, // 香岚溪公交站
	{"flag":"0", "date":"20171202", "lng":137.3130443892702, "lat":35.13523407327354, "title":"　", "content":"", "img":"img/map/xlx6.jpg"},
	{"flag":"0", "date":"20171230", "lng":136.90121231835764, "lat":35.14282363159182, "title":"", "content":""}, // 金山 去机场接朋友中转，忘了是不是第一次
	{"flag":"0", "date":"20171202", "lng":136.91407456, "lat":35.13990697, "title":"　", "content":"", "img":"img/map/mgwroad2.jpg"}, // 去买御守途中
	{"flag":"0", "date":"20171202", "lng":136.91034210060593, "lat":35.12556753025109, "title":"　", "content":"", "img":"img/map/rtsghgq.jpg"}, // 热天神宫会馆 前
	{"flag":"0", "date":"20171202", "lng":136.90819611, "lat":35.12426219, "title":"　", "content":"", "img":"img/map/rtsgnsc.jpg"}, // 热天神宫-南神池 附近买了一个 绸鱼烧
	{"flag":"0", "date":"20171202", "lng":136.91619353, "lat":35.15808728, "title":"　", "content":"", "img":"img/map/mgwroad3.jpg"}, // 买御守返回途中
	{"flag":"0", "date":"20171202", "lng":136.90951030199744, "lat":35.17074438060087, "title":"　", "content":"", "img":"img/map/nagoyatv3.jpg"},
	// 京都，遍地古建筑，记录不全。后来知道本能寺，五条大桥之类的，都擦肩而过……
	{"flag":"0", "date":"20171231", "lng":135.75849308, "lat":34.98622483, "title":"京都", "content":"大晦日和朋友出行第一站，JR站了一路，不过速度挺快的", "img":"img/map/kyoto.jpg"},
	{"flag":"0", "date":"20171231", "lng":135.76672382962815, "lat":34.989209477929855, "title":" ", "content":"", "img":"img/map/jdd.jpg"},
	{"flag":"0", "date":"20171231", "lng":135.76736203847236, "lat":34.989223036761366, "title":" ", "content":"", "img":"img/map/qtt.jpg"},
	{"flag":"0", "date":"20171231", "lng":135.7830975516529, "lat":34.99523307047112, "title":" ", "content":" ", "img":"img/map/jrwm.jpg"},
	{"flag":"0", "date":"20171231", "lng":135.78303017873964, "lat":34.99550289887008, "title":" ", "content":"", "img":"img/map/kiyomizurwm.jpg"}, // 清水寺-仁王门
	{"flag":"0", "date":"20171231", "lng":135.78380272147822, "lat":34.995214589041076, "title":"清水寺", "content":"出行第一个去的景点，人挺多的，依旧没进去，朋友想买的樱花铃铛断货了", "img":"img/map/kiyomizu.jpg"}, // 清水寺-三重塔 景清爪形观音
	{"flag":"0", "date":"20171231", "lng":135.78391043470154, "lat":34.995209397213195, "title":" ", "content":" ", "img":"img/map/kiyomizusqt.jpg"}, // 清水寺-随求堂 by朋友相机
	{"flag":"0", "date":"20171231", "lng":135.78376670581994, "lat":34.99497653081895, "title":" ", "content":"眺望京都市区，能看到附近的清水寺十一重石层塔和远处的京都塔", "img":"img/map/kiyomizutw.jpg"},
	{"flag":"0", "date":"20171231", "lng":135.78437755356674, "lat":34.99479541205007, "title":" ", "content":" ", "img":"img/map/kiyomizuhm.jpg"}, // 清水寺-轰门 by朋友相机
	{"flag":"0", "date":"20171231", "lng":135.78453924855853, "lat":34.99551618842618, "title":" ", "content":" ", "img":"img/map/kiyomizuqtsfq.jpg"}, // 清水寺-千体石仏(fo)群
	{"flag":"0", "date":"20171231", "lng":135.78355217, "lat":34.99573828, "title":" ", "content":" ", "img":"img/map/kiyomizusb.jpg"},
	{"flag":"0", "date":"20171231", "lng":135.78086517902273, "lat":34.99631827563217, "title":"三年坂(产宁坂)", "content":"", "img":"img/map/sannnenzaka.jpg"},
	{"flag":"0", "date":"20171231", "lng":135.78082475527478, "lat":34.99805548800543, "title":"二年坂(二宁坂)", "content":"", "img":"img/map/ninensannen.jpg"},
	{"flag":"0", "date":"20171231", "lng":135.7806720433381, "lat":34.99949697640405, "title":" ", "content":"", "img":"img/map/lysfgcsbbdt.jpg"}, // 眺望 霊応山法観禅寺八坂の塔
	{"flag":"0", "date":"20171231", "lng":135.78109663019154, "lat":34.99979008914013, "title":"高台寺", "content":"路过，能看到灵山观音", "img":"img/map/gts.jpg"},
	{"flag":"0", "date":"20171231", "lng":135.78028680595182, "lat":35.000523953682475, "title":" ", "content":"", "img":"img/map/tsb.jpg"}, // 台所坂
	{"flag":"0", "date":"20171231", "lng":135.78002975489844, "lat":35.001936359935016, "title":" ", "content":"", "img":"img/map/lcsdyy.jpg"}, // 龍池山大雲院-祇園閣
	{"flag":"0", "date":"20171231", "lng":135.77849814400392, "lat":35.00274577552752, "title":" ", "content":"", "img":"img/map/bbsssnj.jpg"}, // 八坂神社-石鳥居
	{"flag":"0", "date":"20171231", "lng":135.77850263553148, "lat":35.002982315544834, "title":" ", "content":"", "img":"img/map/bbssnlm.jpg"}, // 八坂神社-南楼门
	{"flag":"0", "date":"20171231", "lng":135.77852958469677, "lat":35.00330016510644, "title":" ", "content":"", "img":"img/map/bbsswd.jpg"}, // 八坂神社-舞殿
	{"flag":"0", "date":"20171231", "lng":135.77859695761003, "lat":35.0035034403356, "title":"八坂神社", "content":"", "img":"img/map/bbss.jpg"},
	{"flag":"0", "date":"20171231", "lng":135.77552531, "lat":35.00377147, "title":" ", "content":"", "img":"img/map/hjxlq.jpg"},
	{"flag":"0", "date":"20171231", "lng":135.77473030962355, "lat":35.00194192563108, "title":"花间小路", "content":"", "img":"img/map/hjxl.jpg"},
	{"flag":"0", "date":"20171231", "lng":135.77380486, "lat":34.99931803, "title":" ", "content":"", "img":"img/map/jrsxl.jpg"},
	{"flag":"0", "date":"20171231", "lng":135.77341409710306, "lat":34.99936232862022, "title":"建仁寺", "content":"", "img":"img/map/jrs.jpg"}, // 建仁寺-三门
	{"flag":"0", "date":"20171231", "lng":135.7724550187818, "lat":34.99909717348377, "title":" ", "content":"", "img":"img/map/jrscja.jpg"}, // 建仁寺-禅居庵
	{"flag":"0", "date":"20171231", "lng":135.7689470481691, "lat":34.997380210549295, "title":"鸭川", "content":"", "img":"img/map/yc.jpg"},
	{"flag":"0", "date":"20171231", "lng":135.747945, "lat":34.994811, "title":"", "content":""}, // （住宿一晚）
	//{"flag":"0", "date":"20171231", "lng":135.74868742702245,"lat":34.99606006423534, "title":"", "content":""}, // 一直吃饭的地
	{"flag":"0", "date":"20171231", "lng":135.7505857711414, "lat":34.999773558696035, "title":" ", "content":"", "img":"img/map/ytgxmsg.jpg"}, // 遠藤剛熈美術館 by朋友相机
	{"flag":"0", "date":"20171231", "lng":135.751462, "lat":35.012845, "title":"二条城", "content":"去的时候没开门", "img":"img/map/etc.jpg"},
	{"flag":"0", "date":"20171231", "lng":135.72876631, "lat":35.03890086, "title":"金阁寺", "content":"到的时候都傍晚了，出来已经晚上，一路步行（穷，超过5万步），最后走不动了，做的公交回去的", "img":"img/map/kinnkakuji.jpg"}, // 金阁寺-镜湖池与舍利殿
	{"flag":"0", "date":"20171231", "lng":135.72853047, "lat":35.03984764, "title":" ", "content":"", "img":"img/map/kinnkakujilm.jpg"}, // 金阁寺-龍門滝
	{"flag":"0", "date":"20171231", "lng":135.72884487692838, "lat":35.04018745182837, "title":" ", "content":"", "img":"img/map/kinnkakujibs.jpg"}, // 金阁寺-白蛇の塚
	{"flag":"0", "date":"20171231", "lng":135.72913239, "lat":35.04004117, "title":" ", "content":"", "img":"img/map/kinnkakuji3.jpg"},
	{"flag":"0", "date":"20171231", "lng":135.72923956, "lat":35.04023594, "title":" ", "content":"", "img":"img/map/kinnkakujixj.jpg"}, // 金阁寺-夕佳亭-贵人塌
	//{"flag":"0", "date":"20171231", "lng":135.7473579348677, "lat":34.99601940549828, "title":"", "content":""}, // 罗森 大宫五条
	{"flag":"0", "date":"20171231", "lng":135.74333952384575, "lat":35.00161137433349, "title":"壬生寺", "content":"除夜，敲了新年的钟声，晚上回宾馆大家饮酒作欢", "img":"img/map/rss.jpg"},
	{"flag":"0", "date":"20180101", "lng":135.77093518036352, "lat":34.96701084565998, "title":" ", "content":"", "img":"img/map/inarirk.jpg"}, // 伏见稻荷大社-入口-狐像
	{"flag":"0", "date":"20180101", "lng":135.77224670640808, "lat":34.967110680025705, "title":" ", "content":"", "img":"img/map/inariebnj.jpg"}, // 伏见稻荷大社-二番鸟居
	{"flag":"0", "date":"20180101", "lng":135.7723634861244, "lat":34.967110680025705, "title":" ", "content":"", "img":"img/map/inari3.jpg"},
	{"flag":"0", "date":"20180101", "lng":135.77255662180903, "lat":34.967114377592466, "title":" ", "content":"", "img":"img/map/inarilm.jpg"}, // 伏见稻荷大社-楼门-狛狐（键 玉）
	{"flag":"0", "date":"20180101", "lng":135.7728485710998, "lat":34.96704042622559, "title":" ", "content":"", "img":"img/map/inariwbd.jpg"}, // 伏见稻荷大社-外拜殿
	{"flag":"0", "date":"20180101", "lng":135.77308213053237, "lat":34.96711807515903, "title":"伏见稻荷大社", "content":"初拜，抽了签，去了向往已久的千本鸟居（居然还有(魔法少女)小圆(pv)做宣传）", "img":"img/map/inaribd.jpg"}, // 伏见稻荷大社-本殿
	{"flag":"0", "date":"20180101", "lng":135.7733471306578, "lat":34.96743976280645, "title":" ", "content":"", "img":"img/map/inari7.jpg"},
	{"flag":"0", "date":"20180101", "lng":135.77397145298724, "lat":34.967192026455166, "title":" ", "content":"", "img":"img/map/inari8.jpg"},
	{"flag":"0", "date":"20180101", "lng":135.77472602961564, "lat":34.96701454323127, "title":" ", "content":"", "img":"img/map/inari9.jpg"},
	{"flag":"0", "date":"20180101", "lng":135.77548958929913, "lat":34.96649688161205, "title":" ", "content":"", "img":"img/map/inari10.jpg"},
	{"flag":"0", "date":"20180101", "lng":135.77544467402362, "lat":34.96694798692227, "title":" ", "content":"", "img":"img/map/senhon.jpg"}, // 不准确
	// 神户
	{"flag":"0", "date":"20180101", "lng":135.25044178, "lat":34.71221219, "title":" ", "content":"", "img":"img/map/swc.jpg"},
	{"flag":"0", "date":"20180101", "lng":135.254281, "lat":34.711266, "title":"", "content":""}, // （住宿一晚）
	{"flag":"0", "date":"20180101", "lng":135.18948725962034,　"lat":34.68833666936849, "title":"长安门", "content":"", "img":"img/map/cam.jpg"},
	{"flag":"0", "date":"20180101", "lng":135.1866688466177, "lat":34.68313750491544, "title":" ", "content":"", "img":"img/map/sh4.jpg"},
	{"flag":"0", "date":"20180101", "lng":135.186724, "lat":34.682646, "title":"神户港塔", "content":"计划失误，错过六甲山的夜景，其他地方也没怎么逛。牛肉只吃了牛丼，神户牛最后没吃。", "img":"img/map/sht.jpg"},
	{"flag":"0", "date":"20180101", "lng":135.18714045701043, "lat":34.68249188324984, "title":" ", "content":"", "img":"img/map/shhybwg.jpg"}, // 神户海洋博物馆
	{"flag":"0", "date":"20180101", "lng":135.18695181285332, "lat":34.68137501998194, "title":" ", "content":"", "img":"img/map/sh7.jpg"},
	{"flag":"0", "date":"20180101", "lng":135.18493511698344, "lat":34.68027298384968, "title":" ", "content":"", "img":"img/map/sh8.jpg"},
	{"flag":"0", "date":"20180101", "lng":135.18559537153328, "lat":34.67805402444434, "title":"旧神户港信号所", "content":"", "img":"img/map/jshgxhs.jpg"},
	{"flag":"0", "date":"20180101", "lng":135.188112, "lat":34.688225, "title":"南京町", "content":"", "img":"img/map/njt.jpg"},
	{"flag":"0", "date":"20180102", "lng":135.2499907797162, "lat":34.7134840309345, "title":" ", "content":"", "img":"img/map/swcz.jpg"}, // 石屋川站 离去
	// 大阪
	{"flag":"0", "date":"20180102", "lng":135.500152, "lat":34.651705, "title":" ", "content":"", "img":"img/map/dabanzhusu.jpg"}, // （住宿一晚）
	{"flag":"0", "date":"20180102", "lng":135.5013897966611,　"lat":34.67523255742592, "title":"心斋桥", "content":"", "img":"img/map/xzq.jpg"},
	{"flag":"0", "date":"20180102", "lng":135.500745, "lat":34.669143, "title":"道顿崛", "content":"著名的格力高广告牌，吃了一份章鱼小丸子", "img":"img/map/doutonnbori.jpg"},
	{"flag":"0", "date":"20180102", "lng":135.50123869, "lat":34.669263, "title":" ", "content":"", "img":"img/map/xzqj.jpg"},
	{"flag":"0", "date":"20180102", "lng":135.50609686, "lat":34.66878442, "title":" ", "content":"", "img":"img/map/ddj.jpg"},
	{"flag":"0", "date":"20180102", "lng":135.50602050403157, "lat":34.661807230296255, "title":" ", "content":"", "img":"img/map/rbq.jpg"}, // JUNGLE　ジャングル大阪日本橋店
	{"flag":"0", "date":"20180102", "lng":135.5059621141734, "lat":34.65961375228644, "title":"大阪日本桥", "content":"宅的三大圣地之一（后来才知道的），因为是元旦，开着的店铺不多，陪朋友在附近买了海贼王的手办", "img":"img/map/osakanihonhasi.jpg"}, // スーパーキッズランド本店 感觉地址变了，18年在拐角
	{"flag":"0", "date":"20180102", "lng":135.506301, "lat":34.652519, "title":"通天阁", "content":"上塔上溜了一圈，夜景还行", "img":"img/map/ttg.jpg"},
	{"flag":"0", "date":"20180103", "lng":135.53340803, "lat":34.68183667, "title":" ", "content":"", "img":"img/map/dbcyg.jpg"},
	{"flag":"0", "date":"20180103", "lng":135.53194642166054, "lat":34.68274481702262, "title":" ", "content":"", "img":"img/map/dbcpq.jpg"}, // 大阪城-喷水广场
	{"flag":"0", "date":"20180103", "lng":135.53080571236214, "lat":34.68434149041188, "title":" ", "content":"", "img":"img/map/dbcww.jpg"},
	{"flag":"0", "date":"20180103", "lng":135.52916281, "lat":34.68418328, "title":" ", "content":"", "img":"img/map/dbcyt.jpg"},
	{"flag":"0", "date":"20180103", "lng":135.52868014, "lat":34.68508122, "title":" ", "content":"", "img":"img/map/dbcyg2.jpg"},
	{"flag":"0", "date":"20180103", "lng":135.5256911480632, "lat":34.68502947143895, "title":" ", "content":"", "img":"img/map/dbcym.jpg"}, // 大阪城-樱门
	{"flag":"0", "date":"20180103", "lng":135.5260849782079, "lat":34.686006257525875, "title":" ", "content":"", "img":"img/map/dbcyg3.jpg"},
	{"flag":"0", "date":"20180103", "lng":135.52608048668037, "lat":34.68588752703994, "title":" ", "content":"", "img":"img/map/dbcgwzx.jpg"},
	{"flag":"0", "date":"20180103", "lng":135.525915, "lat":34.687154, "title":"大阪城", "content":"没有登阁，外面有个老爷爷穿着铠甲和游客免费拍照（旗子上汉语翻译不对）", "img":"img/map/dbc.jpg"},
	{"flag":"0", "date":"20180103", "lng":135.52546963893357, "lat":34.687271468594524, "title":" ", "content":"", "img":"img/map/dbc2.jpg"},
	{"flag":"0", "date":"20180103", "lng":135.5257031983662, "lat":34.68766846628601, "title":" ", "content":"", "img":"img/map/dbc3.jpg"},
	{"flag":"0", "date":"20180103", "lng":135.5268395548363, "lat":34.68845132526263, "title":" ", "content":"", "img":"img/map/dbcyg4.jpg"},

	{"flag":"0", "date":"20180103", "lng":135.50028352905616,"lat":34.733231517881514, "title":" ", "content":"", "img":"img/map/xdb.jpg"}, // 途经 新大阪站
	{"flag":"0", "date":"20180103", "lng":136.26371633861913,"lat":35.27213430911956, "title":" ", "content":"", "img":"img/map/yg.jpg"}, // 途经 彦根站
	// 国内
	// 杭州 第一次实习工作的地方，记录一下去过的景点
	{"flag":"1", "date":"201209", "lng":120.1519781134771,"lat":30.244851536856824,"title":"西湖","content":"5A景区，去过多次，白天和夜晚都去过。自己曾经绕着西湖边缘走过一圈，也和朋友做坐船去过一次湖心岛"},
	{"flag":"1", "date":"2012", "lng":120.21521832954564,"lat":30.2141357573887,"title":"星光大道步行街","content":""},
	{"flag":"1", "date":"2013", "lng":120.12532161611283,"lat":30.196478066136333,"title":"九溪","content":"溪部门组织过一次烧烤，根据记忆应该在这"},
	{"flag":"1", "date":"20131004", "lng":120.1078432408899,"lat":30.246836734962123,"title":"灵隐寺","content":"貌似接近傍晚去的，时间有点赶，出来都晚上了"},
	{"flag":"1", "date":"20131005", "lng":120.17738740347114,"lat":30.248201233617486,"title":"南宋御街","content":""},
	{"flag":"1", "date":"20131005", "lng":120.11203482423002,"lat":30.225308671925006,"title":"龙井村","content":""},
	{"flag":"1", "date":"20131005", "lng":120.10801396385207,"lat":30.226361021658192,"title":"老龙井十八颗","content":""},
	{"flag":"1", "date":"20131006", "lng":120.07135146598863,"lat":30.273740688825736,"title":"西溪湿地","content":"雨中漫步西溪湿地，因为下雨的原因，没怎么看到水鸟。朋友最后体力不支，坐着船出来的。五A级景区并没有想象中的惊艳"},
	// 南京 杭州工作时，五一去的，两天一晚
	{"flag":"1", "date":"20140501", "lng":118.80466582315545, "lat":31.974957361842037, "title":"", "content":""}, // 南京南 错过了一趟高铁，到晚上才到
	{"flag":"1", "date":"20140501", "lng":118.7952540966663, "lat":32.02698892825407, "title":"南京夫子庙", "content":"5A景区"},
	{"flag":"1", "date":"20140502", "lng":118.86144681613565, "lat":32.05972339827544, "title":"中山陵", "content":"五一去的，真的是看人"},
	{"flag":"1", "date":"20140502", "lng":118.78708805042787, "lat":32.00386922910669,"title":"雨花台","content":""},
	{"flag":"1", "date":"20140502", "lng":118.7504162551024, "lat":32.040838958517504, "title":"侵华日军南京大屠杀遇难同胞纪念馆", "content":""},
	{"flag":"1", "date":"20140502", "lng":118.80326788012081, "lat":32.090501658370115,"title":"玄武湖","content":"只是在边上溜达了一下"},
	// 上海 经常出差的城市，只记录一下去过的景点之类
	{"flag":"1", "date":"20140816", "lng":121.50637574359322,"lat":31.245372305629875,"title":"东方明珠广播电视塔","content":"5A景区"},
	{"flag":"1", "date":"20140816", "lng":121.49729387488735,"lat":31.24343497887024,"title":"外滩","content":"去过几次，感觉夜景比较好看。做过轮渡", "img":"img/map/wt.jpg"},
	{"flag":"1", "date":"20140817", "lng":121.57448854617488,"lat":31.216817643905546,"title":"上海新国际博览中心","content":"14年和朋友去看过车展"},
	{"flag":"1", "date":"201803", "lng":121.63442420844504,"lat":31.267787821474553,"title":"华为上研所","content":"以外协的身份干过两个多月，用当时还未上市的P20当作测试机，当然是加壳了的，只能看到屏幕"},
	{"flag":"1", "date":"20180407", "lng":121.50033243819014,"lat":31.189904393687353,"title":"中华艺术宫","content":"", "img":"img/map/zgg.jpg"},
	{"flag":"1", "date":"20180415", "lng":121.51326174939526,"lat":31.315165990319485,"title":"罗森(B站主题店)","content":"占领B站", "img":"img/map/b.jpg"},
	{"flag":"1", "date":"20180421", "lng":121.49814793885099,"lat":31.232235599415468,"title":"豫园","content":"", "img":"img/map/yy.jpg"},
	// 泰州 公司旅游过一次（两天一晚） TODO：坚果手机坏了，数据全丢
	{"flag":"1", "date":"20160416", "lng":119.87424428285318, "lat":32.921835754605574, "title":"", "content":""}, // 兴化汽车客运站 当时在上海出差，从上海过去的，在肯德基吃了午饭
	{"flag":"1", "date":"20160416", "lng":119.73779535894015, "lat":33.036719814165615, "title":"李中水上森林景区", "content":"天公不作美，去的时候下雨，估计第一次看见孔雀", "img":"img/map/lzsssljq.jpg"},
	{"flag":"1", "date":"20160416", "lng":119.84999353747527, "lat":32.94035228346093, "title":"兴化老街", "content":"", "img":"img/map/xhlj.jpg"},
	{"flag":"1", "date":"20160416", "lng":120.03189353120868, "lat":32.56567946513914, "title":"泰州田园牧歌景区", "content":"在这里住宿一晚，油菜花很漂亮，可以骑马（我没骑）", "img":"img/map/tztymgjq.jpg"},
	{"flag":"1", "date":"20160417", "lng":119.92448147951542, "lat":32.4921144032546, "title":"凤城河乔园", "content":"", "img":"img/map/fchqy.jpg"},
	{"flag":"1", "date":"20160417", "lng":119.93684562180891, "lat":32.49149111096095, "title":"凤城河梅园", "content":"", "img":"img/map/fchmy.jpg"},
	// 嘉兴 上海出差时，五一去的，两天一晚 TODO：坚果手机坏了，数据全丢
	{"flag":"1", "date":"20160430", "lng":120.893892901119, "lat":30.945716682190437, "title":"西塘古镇", "content":"5A景区，五一逛了两天，太大了，真累。门票可以第二天继续用（另外景区入口很多，晚上可以随便进）", "img":"img/map/xtgz.jpg"},
	// 北京
	{"flag":"1", "date":"20170324", "lng":116.38514905887304, "lat":39.87119755935899, "title":"", "content":""}, // 北京南
	{"flag":"1", "date":"20170324", "lng":116.40396855930707, "lat":39.91394167597157, "title":"天安门广场", "content":"天安门附近必逛，带着瓶老干妈过安检被要求开箱，人挺多的。当时北京的雾霾还是很严重的", "img":"img/map/bjtam.jpg"},
	{"flag":"1", "date":"20170324", "lng":116.4048264410691,"lat":39.91080096400303, "title":"人民英雄纪念碑", "content":"", "img":"img/map/rmyxjnb.jpg"},
	{"flag":"1", "date":"20170324", "lng":116.41857051537177, "lat":39.91594778164794, "title":"", "content":""}, // 王府井 北京第一顿饭，吃的日式料理，因为国内的太贵
	{"flag":"1", "date":"20170324", "lng":116.64467401223321, "lat":40.04072158492817, "title":"", "content":""}, // （住宿一晚）
	{"flag":"1", "date":"20170324", "lng":116.44312569648702, "lat":39.94288957311585, "title":"", "content":""}, // 附近溜达过，吃过晚饭，具体地点忘了（朋友在东直门地铁站附近上班）
	{"flag":"1", "date":"20170325", "lng":116.60931670736048, "lat":40.08374541109134, "title":"", "content":""}, // 北京首都国际机场 第一次做飞机，还是国际航线，目标东京
	{"flag":"1", "date":"20201012", "lng":116.28352909921283,"lat":39.92408747195381,"title":"","content":""}, // 北京大华总部
	{"flag":"1", "date":"20201012", "lng":116.28668951765802,"lat":39.946877962055765,"title":"","content":""}, // （住宿的地方）
	{"flag":"1", "date":"20201012", "lng":116.28724646707421,"lat":39.87535973805157,"title":"","content":""}, // （吃饭的地方）
	{"flag":"1", "date":"20201112", "lng":116.48802875279678,"lat":39.91810351773734,"title":"","content":""}, // 罗辑思维
	{"flag":"1", "date":"20201112", "lng":116.48888548803718,"lat":39.9206687999526,"title":"","content":""}, // （住宿的地方）
	{"flag":"1", "date":"20210629", "lng":116.48801321211147,"lat":39.99194598269084,"title":"","content":""}, // 讯众
	{"flag":"1", "date":"20211208", "lng":116.58776186441438,"lat":39.92889134875775,"title":"","content":""}, // 滑雪
	{"flag":"1", "date":"20211209", "lng":116.4845375782628,"lat":39.89063023829659,"title":"","content":""}, // （吃饭的地方）
	{"flag":"1", "date":"20211210", "lng":116.52539727387581,"lat":39.930876160903225,"title":"","content":""}, // 朝阳大悦城
	{"flag":"1", "date":"20211211", "lng":116.40082008609096,"lat":40.00857669159825,"title":"奥林匹克公园","content":"想去看鸟巢和水立方的，但是因为筹办冬奥会，无法进入，附近的道路也封闭了，只能绕着走了3/4圈", "img":"img/map/nc.jpg"},
	{"flag":"1", "date":"20211211", "lng":116.35750913931761,"lat":40.04167200938132,"title":"","content":""}, // （吃饭的地方）大概位置，去找朋友
	{"flag":"1", "date":"20211211", "lng":116.4088391246327,"lat":39.94372497887554,"title":"南锣鼓巷","content":"主路就是一条商业街，旁边的小路人很少。外围绕了一下，看到了鼓楼"},
	{"flag":"1", "date":"20211211", "lng":116.40045344269707,"lat":39.94513901514057,"title":"前海","content":"从烟袋斜街溜达到前海，品尝老北京风味小吃文宇奶酪", "img":"img/map/qh.jpg"},
	{"flag":"1", "date":"20211211", "lng":116.46099617983084,"lat":39.94048548033101,"title":"","content":""}, // 三里屯之前应该来过，记不清了
	{"flag":"1", "date":"20211211", "lng":116.46227626518257,"lat":39.93660259410365,"title":"","content":""}, // 悠航鲜啤，朋友说的巨好吃的汉堡店。低情商：可惜我吃不惯，太油腻
	{"flag":"1", "date":"20211212", "lng":116.42543644181144,"lat":39.90336024345263,"title":"","content":""}, // 被朋友拖着在附近电玩城玩了一下，顺便吃了酸菜鱼
	{"flag":"1", "date":"20250305", "lng":116.35858616494299,"lat":39.91623485744331,"title":"","content":""}, // 华信永道
	{"flag":"1", "date":"20250305", "lng":116.35963269086211,"lat":39.904498348581924,"title":"","content":""}, // （住宿的地方）
	{"flag":"1", "date":"20250306", "lng":116.32790903177724,"lat":39.90040583254356,"title":"","content":""}, // 北京西站
	// 广州
	{"flag":"1", "date":"20191127", "lng":113.30913776314385, "lat":23.39143278940526, "title":"", "content":""}, // 广州白云国际机场 国内航线第一次到达，遥墙出发。回济南就比较悲催了，晚上的飞机，因为济南大雾(霾)，飞机延误一个半小时多，虽然飞了但是最后备降浦东，在上海住了一晚。
	{"flag":"1", "date":"20191127", "lng":113.244857242995,"lat":23.108184572121772, "title":" ", "content":"", "img":"img/map/lbzx.jpg"}, // 澜沧古茶 img20191130
	{"flag":"1", "date":"20191127", "lng":113.27836698163883, "lat":23.12167484931582, "title":"黄埔军校同学会旧址", "content":"广州第一顿饭（不对外开放）", "img":"img/map/hpjxtxhjz.jpg"},
	{"flag":"1", "date":"20191127", "lng":113.23933107080038, "lat":23.099438793195404, "title":"", "content":""}, // （住宿的地方）
	{"flag":"1", "date":"20191210", "lng":113.34842726786181, "lat":23.14753461236835, "title":"", "content":""}, // 大华广州所
	{"flag":"1", "date":"20200720", "lng":113.23925808347771,"lat":23.10855414400932,"title":"","content":""}, // （住宿的地方）
	{"flag":"1", "date":"20221017", "lng":113.43654834121092,"lat":23.169648102851763,"title":"","content":""}, // （住宿的地方）
	{"flag":"1", "date":"20221018", "lng":113.5136389886949,"lat":23.15811763421718,"title":"","content":""}, // 云舟生物
	{"flag":"1", "date":"202210", "lng":113.46280935956567,"lat":23.106092060407274,"title":"","content":""}, // 陪朋友去医院看牙
	{"flag":"1", "date":"20221022", "lng":113.30102327964434,"lat":23.12644006873454,"title":"","content":""}, // 常来小聚，朋友带着去逛潮牌，然并没买
	{"flag":"1", "date":"20221022", "lng":113.33259517000288,"lat":23.124070920595432,"title":"","content":""}, // 广州K11购物艺术中心
	{"flag":"1", "date":"20221022", "lng":113.33908080103694,"lat":23.139879651804925,"title":"","content":""}, // 太古汇
	// 武汉
	{"flag":"1", "date":"20191216", "lng":114.43076064504646, "lat":30.61278620395281, "title":"", "content":""}, // 武汉火车站
	{"flag":"1", "date":"20191216", "lng":114.61565967664019, "lat":30.4685575453525, "title":"", "content":""}, // 长江存储
	{"flag":"1", "date":"201912", "lng":114.44859434501387, "lat":30.45830077799561, "title":"", "content":""}, // 武汉新芯
	{"flag":"1", "date":"20191227", "lng":114.22040677936927, "lat":30.773619550126842, "title":"", "content":""}, // 武汉天河国际机场 正是新冠疫情还没有爆出的时候
	{"flag":"1", "date":"20210314", "lng":114.30977665356635,"lat":30.54947683038908,"title":"黄鹤楼","content":"黄鹤楼公园5A，远观过，没有进去", "img":"img/map/hhl.jpg"},
	{"flag":"1", "date":"20210314", "lng":114.2981190992069,"lat":30.553641458451313,"title":"武汉长江大桥","content":"年代久远的大桥，没有想象中的惊艳","img":"img/map/whcjdq.jpg"},
	{"flag":"1", "date":"20210314", "lng":114.31799410861515,"lat":30.547926748259737,"title":"首义公园","content":""},
	{"flag":"1", "date":"20210314", "lng":114.37070420560053,"lat":30.569735779851005,"title":"湖北省博物馆","content":"路过（从长江大桥走到武汉站），因为现场预约名额已满，没有进去","img":"img/map/hbsbwg.jpg"},
	// 深圳
	{"flag":"1", "date":"20200105", "lng":113.81837130372398, "lat":22.637309356687478, "title":"", "content":""}, // 深圳宝安国际机场 第一次在机场吃饭(20221104)，一碗面50多，好贵。发现做飞机多了，什么事都能碰上，比如廊桥坏了……
	{"flag":"1", "date":"20200105", "lng":114.03948915778263, "lat":22.75215205681878, "title":"", "content":""}, // 京泉华
	{"flag":"1", "date":"202001", "lng":114.3095197939928, "lat":22.7889164381731, "title":"", "content":""}, // 京泉华
	{"flag":"1", "date":"20200110", "lng":114.14090214558567, "lat":22.654976647740316, "title":"", "content":""}, // 怡亚通
	{"flag":"1", "date":"20200114", "lng":114.13565154988159, "lat":22.682576935581523, "title":"", "content":""}, // （吃饭的地方）
	{"flag":"1", "date":"20200909", "lng":113.99834160018256,"lat":22.593828970701463,"title":"","content":""}, // 素士
	{"flag":"1", "date":"20200909", "lng":114.00010227898153,"lat":22.598416881525345,"title":"","content":""}, // （住宿的地方）
	{"flag":"1", "date":"20200915", "lng":113.93000008904066,"lat":22.55660103627277,"title":"","content":""}, // （住宿的地方）
	{"flag":"1", "date":"20200916", "lng":113.93525068474474,"lat":22.575298829127266,"title":"","content":""}, // 雷鸟
	// 临沂
	{"flag":"1", "date":"20200409", "lng":118.36301037086804,"lat":35.109582923417925,"title":"","content":""}, // 临沂市人民政府
	{"flag":"1", "date":"20200409", "lng":118.36960900873741,"lat":35.027447163435276,"title":"","content":""}, // （吃饭的地方）
	// 哈尔滨
	{"flag":"1", "date":"20201028", "lng":126.25385679901385,"lat":45.63556624656899,"title":"","content":""}, // 哈尔滨太平国际机场
	{"flag":"1", "date":"20201029", "lng":126.50672980007423,"lat":45.80611514791199,"title":"","content":""}, // 江海证券 附近
	{"flag":"1", "date":"20201105", "lng":126.53193252471651,"lat":45.81332438924681,"title":"","content":""}, // （吃饭的地方） 第一次尝试铁锅炖，血肠，哈尔滨限定啤酒
	{"flag":"1", "date":"20210506", "lng":126.60300142838926,"lat":45.7720082917044,"title":"","content":""}, // （住宿的地方）
	{"flag":"1", "date":"20210507", "lng":126.59400489870679,"lat":45.76310576133965,"title":"","content":""}, // 敷尔佳
	{"flag":"1", "date":"20210508", "lng":126.62667280939493,"lat":45.77417820925599,"title":"中央大街","content":"最早在晚上俄餐厅吃过，后来白天溜达过一圈。尝过马迭尔冰棍", "img":"img/map/zydj.jpg"},
	{"flag":"1", "date":"20210509", "lng":126.623581607623,"lat":45.78703121105477,"title":" ","content":"", "img":"img/map/fhsljnb.jpg"}, // 防洪胜利纪念塔
	{"flag":"1", "date":"20210509", "lng":126.63358832453301,"lat":45.776713158375536,"title":"索菲亚广场","content":"", "img":"img/map/sfygc.jpg"},
	{"flag":"1", "date":"20210509", "lng":126.62941161038279,"lat":45.783341858948944,"title":"","content":""}, // 兆麟公园
	{"flag":"1", "date":"20210515", "lng":126.61530596587855,"lat":45.766020631745235,"title":"","content":""}, // （吃饭的地方） 附近餐馆吃了很多，其中一个 还在零下十几度的时候和朋友在大街上吃冰棍
	{"flag":"1", "date":"20210516", "lng":126.59644707474779,"lat":45.70816400848598,"title":"","content":""}, // 万达广场（哈西店） 附近
	{"flag":"1", "date":"20220227", "lng":126.6233570312455,"lat":45.78896378037229,"title":"哈尔滨松花江冰雪嘉年华","content":"晚上遛弯偶然碰到的，雪雕都化的差不多了。在松花江上溜达了下", "img":"img/map/shj.jpg"},
	// 合肥
	{"flag":"1", "date":"20201130", "lng":117.29695946707743,"lat":31.804617699650294,"title":"","content":""}, // 合肥南站
	{"flag":"1", "date":"20201130", "lng":117.28788074244083,"lat":31.924987478377368,"title":"","content":""}, // （住宿的地方）
	{"flag":"1", "date":"20201201", "lng":117.28216302786983,"lat":31.933158333168233,"title":"","content":""}, // 志邦家具
	{"flag":"1", "date":"202012", "lng":117.30244227475758,"lat":31.99857149329507,"title":"","content":""}, // 志邦家具
	// 滨州
	{"flag":"1", "date":"202101", "lng":117.71985448251809,"lat":36.94385118962924,"title":"","content":""}, // 三星玉米
	// 沈阳
	{"flag":"1", "date":"20220703", "lng":123.50092330724667,"lat":41.63998651746371,"title":"","content":""}, // 沈阳桃仙国际机场
	{"flag":"1", "date":"20220703", "lng":123.47477004062915,"lat":41.6846802548422,"title":"","content":""}, // （住宿的地方）
	{"flag":"1", "date":"20220704", "lng":123.4887625413206,"lat":41.70295472879588,"title":"","content":""}, // 美行科技
	{"flag":"1", "date":"20240115", "lng":123.46791650857132,"lat":41.74152957871274,"title":"","content":""}, // （住宿的地方）
	{"flag":"1", "date":"20240121", "lng":123.44084234406026,"lat":41.72186001397308,"title":"","content":""}, // 老四季 在朋友推荐下尝试鸡架
	{"flag":"1", "date":"20240128", "lng":123.41524674550337,"lat":41.810807841998525,"title":"西塔","content":"西塔，就是一个塔。去步行街逛了一下，就是韩国餐饮一条街，对我没啥吸引力，啥也没买啥也没吃……", "img":"img/map/xt.jpg"},
	// 南阳邓州
	{"flag":"1", "date":"20220913", "lng":112.27292247443494,"lat":32.60196698695591,"title":"","content":""}, // 邓州东站
	{"flag":"1", "date":"20220913", "lng":112.094470042503,"lat":32.667227167818886,"title":"","content":""}, // （住宿的地方）
	{"flag":"1", "date":"20220914", "lng":112.09546716161908,"lat":32.658066542072596,"title":"","content":""}, // 驰诚驾校
	{"flag":"1", "date":"202209", "lng":111.94706264475846,"lat":32.67123666182992,"title":"","content":""}, // 驰诚驾校
	{"flag":"1", "date":"202209", "lng":112.10164305691546,"lat":32.69324616561765,"title":"","content":""}, // （吃饭的地方）
	{"flag":"1", "date":"20220918", "lng":112.10572010630304,"lat":32.67999941252668,"title":"花州书院","content":"虽为4A景区，但只能用“斑驳”来形容", "img":"img/map/hzsy.jpg"},
	{"flag":"1", "date":"202209", "lng":112.11473882413159,"lat":32.684403309318625,"title":"","content":""}, // （吃饭的地方）
	{"flag":"1", "date":"202209", "lng":112.09377753878536,"lat":32.647537411072285,"title":"","content":""}, // 驰诚驾校
	{"flag":"1", "date":"20220925", "lng":112.11731143636632,"lat":32.69076215080687,"title":"","content":""}, // （吃饭的地方）
	// 潮汕附近 杏花吴记牛肉 甘草水果 生腌（血蚶 虾姑 螃蟹） 肠粉 甜汤 蚝烙 都尝试了一下，肠粉 蚝烙在广州就吃过了，潮汕牛肉火锅也是各地吃
	{"flag":"1", "date":"20230207", "lng":116.51517449668025,"lat":23.552563885312814,"title":"","content":""}, // 揭阳潮汕国际机场
	{"flag":"1", "date":"20230208", "lng":116.64513882256547,"lat":23.413736816260116,"title":"","content":""}, // 润和
	{"flag":"1", "date":"202309", "lng":116.6624437349887,"lat":23.40155850838811,"title":"","content":""}, // （吃饭的地方） 杏花吴记
	{"flag":"1", "date":"20230209", "lng":116.70739072065726,"lat":23.367121358133147,"title":"","content":""}, // （吃的地方） 生腌（血蚶 虾姑 螃蟹）甘草水果
	{"flag":"1", "date":"20230209", "lng":116.71611856715876,"lat":23.367751135893975,"title":"","content":""}, // （吃的地方） 甜汤
	{"flag":"1", "date":"20230211", "lng":116.6803345671806,"lat":23.361033145475616,"title":"汕头小公园&汕头老城","content":"", "img":"img/map/stxgyhlc.jpg"},
	{"flag":"1", "date":"20230211", "lng":116.69135228425684,"lat":23.371520524211537,"title":"","content":""}, // 杏花吴记 算是总店，旁边还有自己的屠宰场，排队的人太多，没吃成
	{"flag":"1", "date":"202309", "lng":116.6562245413688,"lat":23.412377134772058,"title":"","content":""}, // （吃饭的地方）
	{"flag":"1", "date":"202309", "lng":116.6608513088117,"lat":23.406979311117773,"title":"","content":""}, // （吃饭的地方）
	// 太原
	{"flag":"1", "date":"20230215", "lng":112.64083252401677,"lat":37.75996929879287,"title":"","content":""}, // 太原武宿国际机场
	{"flag":"1", "date":"20230215", "lng":112.56373891209914,"lat":37.794446633485244,"title":"","content":""}, // （住宿的地方）
	{"flag":"1", "date":"20230216", "lng":112.56188840274858,"lat":37.791299224093784,"title":"","content":""}, // 佳华科技
	{"flag":"1", "date":"20230225", "lng":112.61849063293229,"lat":37.79825684964629,"title":"","content":""}, // 太原南站
	{"flag":"1", "date":"20230219", "lng":112.19023650648019,"lat":37.209513099327836,"title":"平遥古城","content":"5A景区，初见平遥 《又见平遥》", "img":"img/map/py.jpg"}, // 太原公司组织的一日游，古城的主要景点基本都看了，下午看了《又见平遥》
	// 重庆
	{"flag":"1", "date":"20231113", "lng":106.6434751210282,"lat":29.72266939651972,"title":"","content":""}, // 重庆江北国际机场
	{"flag":"1", "date":"20231113", "lng":106.58754599118161,"lat":29.564601015829833,"title":"","content":""}, // （住宿的地方）
	{"flag":"1", "date":"20231113", "lng":106.58349719350366,"lat":29.56350372439025,"title":"解放碑","content":"", "img":"img/map/rmjfjnb.jpg"}, // 千叶眼镜
	{"flag":"1", "date":"20231113", "lng":106.58237004466537,"lat":29.56043514785526,"title":"","content":""}, // （吃饭的地方） 重庆火锅是真的辣
	{"flag":"1", "date":"20231119", "lng":106.58542396899135,"lat":29.568340783855973,"title":"洪崖洞","content":"4A景区，没有拍到全景，大部分都是商业街，没怎么逛", "img":"img/map/hyd.jpg"},
	{"flag":"1", "date":"20231121", "lng":106.4917396873867,"lat":29.538992057244684,"title":"","content":""}, // 千叶眼镜
	// 佛山
	{"flag":"1", "date":"20240228", "lng":113.15648174601603,"lat":23.058040292812674,"title":"","content":""}, // （住宿的地方）
	{"flag":"1", "date":"20240229", "lng":113.17836599535121,"lat":23.02972673899926,"title":"","content":""}, // 星期六
	{"flag":"1", "date":"20240229", "lng":113.15604157631628,"lat":23.06367228009664,"title":"","content":""}, // 佛山遥望
	{"flag":"1", "date":"20240301", "lng":113.15346685306442,"lat":23.057695046592166,"title":"千灯湖","content":"4A景区，只是晚上下班路上逛过，开放式公园"},
	{"flag":"1", "date":"20240302", "lng":113.12034260095461,"lat":23.034812332058866,"title":"祖庙","content":"4A景区，还是很不错的，在一堆人的外面看了舞狮表演，各种雕刻很是惊艳", "img":"img/map/zm.jpg"},
	{"flag":"1", "date":"20240303", "lng":113.11986780157748,"lat":23.041119034510952,"title":"","content":""}, // （吃饭的地方） 尝试了新鲜猪杂粥
	{"flag":"1", "date":"20240303", "lng":112.98395660338757,"lat":22.93167135936873,"title":"西樵山风景名胜区","content":"5A景区，走了十几公里，只逛了下南边的景点，作为自然景点还所可以吧"},
	// 青岛 5oKy5Lyk55qE5pWF5LqL
	{"flag":"1", "date":"20240814", "lng":120.31641657521578,"lat":36.268621194023865,"title":"","content":""}, // MjAyNDA4MTTpnZLlspvnrKzkuIDnq5nvvIzor7fmiJHlkIPljYjppa3vvIzlkI7mnaUyMDI0MDgxOOi/mOivt+aIkeWQg+aZmumlrQ==
	{"flag":"1", "date":"20240814", "lng":120.34730728051653,"lat":36.255906927635586,"title":"","content":""}, // 5Y6755yL5oCd5oCd77yM5oiR5rKh5Y675oiQ
	{"flag":"1", "date":"20240814", "lng":120.29470902256716,"lat":36.270207060992,"title":"","content":""}, // 6ZmE6L+R5om+5LqG5YWs5Zut5Z2Q5Z2Q77yM55So54uX5bC+5be06I2J5Yi25L2c5LqG6Iqx546v
	{"flag":"1", "date":"20240818", "lng":120.25434366447631,"lat":36.2735205451284,"title":"","content":""}, // 6auY5a6e5ZCI6IuRIOmdkuWym+S9j+eahOWcsOaWue+8jOaipuW8gOWni+eahOWcsOaWue+8jOesrOS4gOasoeWOu+aOpemAgeW9k+WkqeWwseWbnuadpeS6hu+8jOaQrOWutuWJjTIwMjQwODE45L2P6L+H5Yeg5pma77yM5Y676L+H6ZmE6L+R6LaF5biC6LSt54mp
	{"flag":"1", "date":"20240818", "lng":120.33324305013011,"lat":36.289054057390246,"title":" ","content":"", "img":"img/map/xyhfbq.jpg"}, // 5pif6Zuo5Y2O5bqc5YyX5Yy6IDIwMjQwODE456ys5LiA5qyh5om+5oi/5a2Q77yM5pyA57uI6YCJ5Lit77yMMjAyNDA4MjTmkKzlrrbvvIzkvY/ov4fkuIDmrrXml7bpl7TvvIzmoqblu7bnu63nmoTlnLDmlrkg5Lmf5piv5qKm57uT5p2f55qE5Zyw5pa5
	{"flag":"1", "date":"20240818", "lng":120.31305363379336,"lat":36.29431936572242,"title":"","content":""}, // 55yL5oi/5a2Q5LmL5LiA77yM5Yia5byA5aeL5om+6ZSZ5LqG5bCP5Yy6
	{"flag":"1", "date":"20240825", "lng":120.29561541282675,"lat":36.26244447718907,"title":"","content":""}, // MjAyNDA4MjXokKXkuJrljoXpgIDlrr3luKbvvIzlsYXnhLbkuI3pgIDmrL7vvIzlpLHor6/vvIzlupTor6Xmi4nliLDmmJ/pm6jljY7lupzlsLHlr7nkuobvvIzmsqHmg7PliLDpgqPovrnkv6Hlj7fov5nkuYjlt64=
	{"flag":"1", "date":"20240826", "lng":120.30814439418133,"lat":36.28886496506443,"title":"","content":""}, // MjAyNDA4MjblhYXnh4PmsJTvvIzljaHlhYXkuIrkuobvvIzooajmnIDlkI7ov5jmmK/msqHlhYXkuIrvvIzlkI7mnaXmjaLnmoTooag=
	{"flag":"1", "date":"20240914", "lng":120.40147627056535,"lat":36.23755594830023,"title":"","content":""}, // MjAyNDA5MTTljrvlp6jniLbpgqM=
	{"flag":"1", "date":"20240920", "lng":120.30867354327619,"lat":36.28603535964256,"title":"","content":""}, // MjAyNDA5MjDnmb7mnpzlm63vvIzljrvkubDmprTojrLvvIzku6XlkI7mprTojrLkvpvlupTlnLA=
	{"flag":"1", "date":"20240922", "lng":120.42796851500127,"lat":36.31204670840243,"title":"","content":""}, // MjAyNDA5MjLlrrblrrbmgqbvvIzljrvnnIvlsI/lp5E=
	{"flag":"1", "date":"20240922", "lng":120.39781689055886,"lat":36.30129636339674,"title":"","content":""}, // 5Y6755yL5bCP5aeR
	{"flag":"1", "date":"20240929", "lng":120.31664600467725,"lat":36.278176422721025,"title":"","content":""}, // MjAyNDA5MjnmtJfovabvvIzkuI3og73mtJc=
	{"flag":"1", "date":"20240929", "lng":120.31588244499376,"lat":36.28423889377843,"title":"","content":""}, // 5rSX6L2m77yM5rSX5LqG
	{"flag":"1", "date":"20240929", "lng":120.33812898094837,"lat":36.29897304538611,"title":"","content":""}, // 5Yqg5rK5
	{"flag":"1", "date":"20240929", "lng":120.36430551144436,"lat":36.23430493249445,"title":"","content":""}, // 5Y675LqU5Zub5bm/5Zy66YCU57uP5YWs5Lqk56uZ
	{"flag":"1", "date":"20240929", "lng":120.39187536093581,"lat":36.06724884499414,"title":"五四广场","content":"只是去看了下五四的风，做公交去的，手机还没电了，只溜达了一会", "img":"img/map/wsdf.jpg"},
	{"flag":"1", "date":"20240930", "lng":120.3859817154649,"lat":36.311934013859464,"title":"","content":""}, // MjAyNDA5MzDmjqXlsI/lp5E=
	// 菏泽
	{"flag":"1", "date":"20241206", "lng":115.51155144194702,"lat":35.236189038702896,"title":"","content":""}, // 荷泽站
	{"flag":"1", "date":"20241206", "lng":115.52639144897186,"lat":35.2282911140469,"title":"","content":""}, // （住宿一晚）
	{"flag":"1", "date":"20241207", "lng":115.53202831604698,"lat":35.22965110130553,"title":"","content":""}, // 婚礼现场
	{"flag":"1", "date":"20241207", "lng":115.45154014235295,"lat":35.25080349647015,"title":"老城曹州","content":"简单逛了下，被吐槽去菏泽的时间不对，没有牡丹。夜景应该更好看", "img":"img/map/lccz.jpg"},
	// 济宁
	{"flag":"1", "date":"20241207", "lng":116.60679246887744,"lat":35.39875842800638,"title":"","content":""}, // 济宁站
	{"flag":"1", "date":"20241207", "lng":116.59206475004136,"lat":35.42614969098095,"title":"","content":""}, // （吃饭的地方）
	{"flag":"1", "date":"20241207", "lng":116.69824338111995,"lat":35.35363243724849,"title":"","content":""}, // （住宿一晚）
	{"flag":"1", "date":"20241208", "lng":116.5941218696592,"lat":35.33103610675289,"title":"太白湖旅游景区","content":"4A景区，转了一下，走了12多公里。去的时间依旧不对，无映日荷花别样红", "img":"img/map/tbh.jpg"},
	// 邯郸
	{"flag":"1", "date":"20250306", "lng":114.56598917600896,"lat":36.62578038078121,"title":"","content":""}, // 邯郸东站
	{"flag":"1", "date":"20250306", "lng":114.51840144161787,"lat":36.59749547332992,"title":"","content":""}, // 公积金中心
	{"flag":"1", "date":"20250306", "lng":114.52629305552303,"lat":36.601555440679704,"title":"","content":""}, // （住宿的地方）
	{"flag":"1", "date":"20250309", "lng":114.5114568662966,"lat":36.603166400497734,"title":"","content":""}, // 看了哪吒之魔童闹海

	// 倒叙 时间为拍照日期 对以前的一些回忆
	// 有些地点去过多次，并不一定是第一次
	{"flag":"1", "date":"20250502", "lng":119.98097169323624,"lat":37.13040816463076,"title":" ","content":"", "img":"img/map/dst.jpg"},
	{"flag":"1", "date":"20250321", "lng":121.41614050819742,"lat":37.54783616018456,"title":" ","content":"", "img":"img/map/hbgc.jpg"},
	// 只有红米K30PRO变焦版&小米5sPlus 和 诺基亚5320（还是缺少照片）
	// 乐视2没用到，坏过，缺失过一部分照片。坚果和小米1S以及联想的手机都坏了，从hp电脑里找出来一些
	// 烟台 干网优的时候，几乎跑遍了全烟台（东快到潍坊 南到海阳海边 西到威海边界 不过龙口蓬莱没跑过），但是记录的很少
	{"flag":"1", "date":"20241107", "lng":121.32177063756238,"lat":37.585616152128054,"title":" ","content":"", "img":"img/map/ytht-jhdq.jpg"},
	{"flag":"1", "date":"20241103", "lng":120.0011330352916,"lat":37.14098766036649,"title":"云峰山","content":"", "img":"img/map/yfs.jpg"},
	{"flag":"1", "date":"20241026", "lng":119.91984986122124,"lat":37.386807702817514,"title":" ","content":"", "img":"img/map/cs.jpg"},
	{"flag":"1", "date":"20241003", "lng":121.46092440428127,"lat":37.52384169129576,"title":"海昌渔人码头 粉黛花海","content":"4A景区", "img":"img/map/yrmt.jpg"},
	{"flag":"1", "date":"20241003", "lng":121.66004729515053,"lat":37.490166177586126,"title":"养马岛 獐岛","content":"4A景区", "img":"img/map/ymd-zd.jpg"},
	{"flag":"1", "date":"20240928", "lng":120.30527682333238,"lat":36.27353146499762,"title":" ","content":"", "img":"img/map/qdlb.jpg"},
	{"flag":"1", "date":"20240915", "lng":120.07063376480144,"lat":37.15734969783734,"title":" ","content":"", "img":"img/map/gktj.jpg"},
	{"flag":"1", "date":"20240509", "lng":121.61329947641129,"lat":37.47236861525887,"title":"养马岛","content":"4A景区", "img":"img/map/ymd-gjt.jpg"},
	{"flag":"1", "date":"20240509", "lng":121.61820696432756,"lat":37.39027601296539,"title":"烟台市牟平区博物馆","content":"百年流苏", "img":"img/map/mpbwg-bnls.jpg"},
	{"flag":"1", "date":"20240214", "lng":120.07376885103126,"lat":37.20097134839021,"title":" ","content":"", "img":"img/map/mjz.jpg"},
	{"flag":"1", "date":"20240106", "lng":120.22063919322758,"lat":30.276139152745753,"title":" ","content":"", "img":"img/map/qjjdqcld.jpg"},
	{"flag":"1", "date":"20230306", "lng":120.216084784292,"lat":30.246754690803833,"title":" ","content":"", "img":"img/map/hzgmjjds.jpg"},
	{"flag":"1", "date":"20220610", "lng":121.37361184854322,"lat":37.60754608914226,"title":" ","content":"", "img":"img/map/ythb-xha.jpg"},
	{"flag":"1", "date":"20220208", "lng":120.76137172821774,"lat":37.8320159938661,"title":"蓬莱阁景区","content":"5A景区，过年回烟台路过，没带身份证买的全票。夜晚快关门的时间去的，去看了虎年的花灯，很漂亮", "img":"img/map/plg.jpg"},
	{"flag":"1", "date":"20210818", "lng":121.36069421530974,"lat":37.5979042959138,"title":" ","content":"", "img":"img/map/ythb-xha2.jpg"},
	{"flag":"1", "date":"20210326", "lng":117.06689787394266,"lat":36.683130906934025,"title":" ","content":"", "img":"img/map/sddxtyg.jpg"},
	{"flag":"1", "date":"20150603", "lng":121.36580022874374,"lat":37.55937098304097,"title":"革命烈士纪念碑","content":"", "img":"img/map/gmlsjnb.jpg"},
	{"flag":"1", "date":"20141221", "lng":121.48610624332028,"lat":37.463250002141834,"title":" ","content":"", "img":"img/map/ytlhgjrjy.jpg"},
	{"flag":"1", "date":"20141004", "lng":121.28604116471686,"lat":37.48882308271907,"title":"烟台农博园","content":"", "img":"img/map/ytnby.jpg"},
	{"flag":"1", "date":"20140823", "lng":121.44019214192485,"lat":37.54146048046382,"title":"月亮湾","content":"", "img":"img/map/ylw.jpg"},
	{"flag":"1", "date":"20140823", "lng":121.44523612736339,"lat":37.53671769337549,"title":"栈桥","content":"", "img":"img/map/zq.jpg"},
	{"flag":"1", "date":"20120803", "lng":121.45821956147545,"lat":37.52547888376951,"title":"烟台海昌鲸鲨馆","content":"", "img":"img/map/ythcjsg.jpg"},
	{"flag":"1", "date":"20110206", "lng":120.76746286838925,"lat":37.82900763989994,"title":"八仙群雕","content":"", "img":"img/map/bxqd.jpg"},
	{"flag":"1", "date":"20110206", "lng":120.75419938753443,"lat":37.83231018019678,"title":"蓬莱海洋极地世界","content":"4A景区，春节时候去的，人巨多。父亲还被采访，上烟台电视了", "img":"img/map/plhyjdsj.jpg"},
	// 济南 工作所在地最长的城市
	{"flag":"1", "date":"20200909", "lng":117.18589571365554,"lat":36.72237053434131,"title":" ","content":"", "img":"img/map/jgxc.jpg"},
	{"flag":"1", "date":"20190414", "lng":117.04943380922788,"lat":36.68873465032671,"title":" ","content":"", "img":"img/map/xlht.jpg"},
	{"flag":"1", "date":"20190223", "lng":117.07195881989057,"lat":36.69169733208033,"title":" ","content":"", "img":"img/map/hjl.jpg"},
	{"flag":"1", "date":"20190217", "lng":117.03963648733277,"lat":36.67951870419143,"title":" ","content":"", "img":"img/map/zqhl.jpg"},
	{"flag":"1", "date":"20190217", "lng":117.03547733282157,"lat":36.68351642929338,"title":" ","content":"", "img":"img/map/dmh.jpg"},
	{"flag":"1", "date":"20180512", "lng":117.02370503911331,"lat":36.68099481171207,"title":" ","content":"", "img":"img/map/dmhhjsfj.jpg"},
	{"flag":"1", "date":"20180512", "lng":117.02341308982257,"lat":36.67958744512695,"title":" ","content":"", "img":"img/map/dmhbwfj.jpg"},
	{"flag":"1", "date":"20180512", "lng":117.02299537776042,"lat":36.67868657216226,"title":"大明湖","content":"5A景区-天下第一泉风景区的核心组成部分之一。最开始的时候收费，只是外围转了下。免费开放的时候进去溜达过几次", "img":"img/map/dmhxnm.jpg"},
	{"flag":"1", "date":"20170831", "lng":117.14053225981839,"lat":36.677563723719814,"title":" ","content":"", "img":"img/map/qlrjy.jpg"},
	{"flag":"1", "date":"20170824", "lng":117.10603859958229,"lat":36.685691774605665,"title":" ","content":"", "img":"img/map/djz.jpg"},
	{"flag":"1", "date":"20150305?", "lng":121.4108988955467,"lat":37.516346940817094,"title":" ","content":"", "img":"img/map/ytts.jpg"},
	{"flag":"1", "date":"20140909", "lng":121.1901223503594,"lat":37.59126875945926,"title":"天马栈桥","content":"", "img":"img/map/tmzq.jpg"},
	{"flag":"1", "date":"20120310", "lng":117.3015448675531,"lat":36.63461579484086,"title":" ","content":"", "img":"img/map/lmssk.jpg"},
	{"flag":"1", "date":"20120225", "lng":117.00818932444967,"lat":36.648495185349994,"title":"英雄山 革命烈士纪念塔","content":"", "img":"img/map/yxs-gmlsjnt.jpg"},
	{"flag":"1", "date":"20120225", "lng":117.01484576827862,"lat":36.64675060647081,"title":"英雄山 迎旭亭","content":"", "img":"img/map/yxs-yxt.jpg"},
	{"flag":"1", "date":"20110501", "lng":117.0296812837759,"lat":36.67105891418392,"title":"芙蓉街","content":"", "img":"img/map/flj.jpg"},
	{"flag":"1", "date":"20101030", "lng":117.27610193825181,"lat":36.64042040351873,"title":" ","content":"", "img":"img/map/sdgc.jpg"},
	{"flag":"1", "date":"20101030", "lng":117.26073628552362,"lat":36.635133029353184,"title":"蟠龙山森林公园","content":"", "img":"img/map/plsslgy.jpg"},
	{"flag":"1", "date":"20101001", "lng":117.03026266933615,"lat":36.6784007508051,"title":" ","content":"", "img":"img/map/dmhnm.jpg"},
	{"flag":"1", "date":"20101001", "lng":117.02856936344985,"lat":36.67886385322528,"title":" ","content":"", "img":"img/map/xy.jpg"},
	{"flag":"1", "date":"20101001", "lng":117.02666944729624,"lat":36.679706837130844,"title":" ","content":"", "img":"img/map/xjxjnc.jpg"},
	{"flag":"1", "date":"20101001", "lng":117.0218410551801,"lat":36.67277455540285,"title":"五龙喷泉","content":"没进五龙潭", "img":"img/map/wlt.jpg"},
	{"flag":"1", "date":"20101001", "lng":117.02352973255884,"lat":36.66908517095555,"title":"五三纪念碑","content":"", "img":"img/map/wsjnb.jpg"},
	{"flag":"1", "date":"20101001", "lng":117.02431125835253,"lat":36.667391721989944,"title":"趵突圣境牌坊","content":"穷学生，买不起门票，没有进趵突泉，门口溜了一下", "img":"img/map/btsjpf.jpg"},
	{"flag":"1", "date":"20101001", "lng":117.02769787012514,"lat":36.66767758460199,"title":"泉标","content":"", "img":"img/map/qb.jpg"}, // 在济南上学第一个十一长假
	// 上海
	{"flag":"1", "date":"20180406", "lng":121.59808779771589,"lat":31.286038146739152,"title":" ","content":"", "img":"img/map/jfl.jpg"},




	// 过路/中转/服务区（不全）
	// 时间不一定是第一次
	{"flag":"1", "lng":118.52754809536565,"lat":36.81393139410993,"title":"","content":""}, // 青州服务区（对面的也去了）
	{"flag":"1", "lng":120.00835316582805,"lat":36.81352519996519,"title":"","content":""}, // 平度服务区
	{"flag":"1", "lng":119.00679583663465,"lat":36.75626089258665,"title":"","content":""}, // 潍坊西服务区
	{"flag":"1", "lng":117.37454328431186,"lat":36.81715045753278,"title":"","content":""}, // 济南东服务区（在潍坊换的车，结果车坏了）
	{"flag":"1", "date":"20230207", "lng":112.66819630222425,"lat":32.95683009280146,"title":"","content":""}, // 邓州→南阳东（邓州→南阳东→新郑机场→揭阳潮汕机场）
	{"flag":"1", "date":"20230207", "lng":113.85933534997378,"lat":34.53227005149788,"title":"","content":""}, // 南阳东→新郑机场
	{"flag":"1", "lng":116.46861160970695,"lat":37.41505199041259,"title":"","content":""}, // 德州东
	{"flag":"1", "date":"20240814", "lng":119.90457350229495,"lat":36.42910585732347,"title":"","content":""}, // 高密服务区 (去高速还走错了，没有实线变道)
	{"flag":"1", "date":"202409", "lng":119.89807560938851,"lat":36.741738944583766,"title":"","content":""}, // 平度服务区（对面的也去了）
	{"flag":"1", "date":"20250314", "lng":114.49114352871474,"lat":38.01670374554708,"title":"","content":""}, // 石家庄站（邯郸东→石家庄站→烟台南）

	]